minhlg/32_ate/esp32_ft_efuse_test.cpp
/////////////////////////////////////////////////////////

	//csicDisableDpin("func_measure_allpins");
    csicDisableDpin("XTAL_P");
	cscUtil->wait(0.001);

	//csicSetDps ("alldps", 0, 100 MA, CONNECT);
    //csicSetDps ("VDD11",  0, 100 MA, CONNECT);
    //csicSetDps ("DVDD11", 0, 100 MA, CONNECT);
    //cscUtil->wait(5e-3);

    //csicSetDps ("alldps", 0, 100 MA, DISCONNECT);
    //csicSetDps ("VDD11",  0, 100 MA, DISCONNECT);
    //csicSetDps ("DVDD11", 0, 100 MA, DISCONNECT);
    //cscUtil->wait(1e-3);

    return;
}
void func_ana()
{

    csicSetDpinLevels("allpins", 0.0, 2.5, 1.0, 1.8);
	cscTester->DCLevels()->Signal("RSTB")->setForceLo();
	//cscTester->DCLevels()->Signal("CHIP_EN")->setForceLo();
    csicSetDps ("DVDD_IO", 2.5 , 300 MA, CONNECT);
    csicSetDps ("VBAT", 2.5, 300 MA, CONNECT);
    cscUtil->wait(5e-3);
    //csicDisableDpin ("allpins");
    csicSetDpinLevels("func_ana1_allpins",0, 2.5, 1, 1.8);
    csicEnableDpin("func_ana1_allpins");
    csicSetDpinLevels("XTAL_P",0.0, 2.5, 1.0, 1.8);
    csicEnableDpin("XTAL_P");
    cscUtil->wait(1e-3);

   csicFuncTest("digital func test","func_dig_fail","func_ana_part1");

   vector<string> lablist;
   lablist.clear();
   lablist.push_back("func_ana_part2.Capdata");
   cscTester->DCM()->add("ADC_dcm_ana",lablist,lablist,"SD_OUT");
   cscTester->DCM()->enable("ADC_dcm_ana");
   csicEnableDpin("func_ana_allpins");
   cscUtil->wait(0.001);
   cscExec->Test()->resetCumulativeResult();



    csicFuncSeq("func_ana_part2");




//    csicFuncTest("Func_ana_test","func_ana_fail","func_ana");
    while(cscTester->Seq()->getRunStatus() == BUSY);
    int capture_count = cscTester->DCM()->getCapturedCycleCount();
    if (capture_count != 1038) {
        cscExec->Datalog()->printf("capture cycle fail\ncycle is %d\n",capture_count);
    }
    int i=0;


CSC_SERIAL_BLOCK_BEGIN
    unsigned long* capture_data = new unsigned long[capture_count];
    memset(capture_data, 0, sizeof(capture_data));
    cscTester->DCM()->getCapturedDataBySite(*cscIter,"SD_OUT",0, capture_count,capture_data, DCM_HW);

    unsigned char data_to_be_checked[519];
    memset(data_to_be_checked, 0, sizeof(data_to_be_checked));
    for (i = 0; i < capture_count; i=i+2) {
        data_to_be_checked[i/2] = capture_data[i]<<4 | capture_data[i+1];
    }


    bool result = 1;

    result  = ate_check((unsigned char*)data_to_be_checked,*cscIter);

    long result_long;
    if (result) {
//        cscExec->Datalog()->printf("ate_check FAIL \n");
          result_long = 0;
    } else {
//        cscExec->Datalog()->printf("ate_check SUCCESS \n");
          result_long = 1;
    }

    csicVariableTest("Func_Ana_Test","func_ana_fail",result_long,1,1,"");
//    csicVariableTest("Func_Ana_Test","func_ana_fail",result_long,-100,100,"");

//    for (i=0; i<capture_count; i++)
//      {
//        cscExec->Datalog()->printf("%X",capture_data[i]);
//        if (i%2 == 1) { cscExec->Datalog()->printf("\n");
//        }
//
//    }
   if(capture_data!=NULL) delete [] capture_data;


CSC_SERIAL_BLOCK_END

	//csicDisableDpin("func_ana_allpins");
	cscUtil->wait(0.001);

	//csicSetDps ("alldps", 0, 100 MA, CONNECT);
    //csicSetDps ("VDD11",  0, 100 MA, CONNECT);
    //csicSetDps ("DVDD11", 0, 100 MA, CONNECT);
    //cscUtil->wait(5e-3);

    //csicSetDps ("alldps", 0, 100 MA, DISCONNECT);
    //csicSetDps ("VDD11",  0, 100 MA, DISCONNECT);
    //csicSetDps ("DVDD11", 0, 100 MA, DISCONNECT);
    //cscUtil->wait(1e-3);

    return;
}

void io_mbist_test()
{
   unsigned long mbist_res0[4];
   unsigned long mbist_res1[4];
   unsigned long mbist_res2[4];
   double        mbist_res[4];
   int           mbist_pass[4]={0,0,0,0};
   double        efuse_burned[4]={0,0,0,0};

    csicSetDpinLevels("allpins", 0.0, 2.5, 1.0, 1.8);
	cscTester->DCLevels()->Signal("RSTB")->setForceLo();
	cscTester->DCLevels()->Signal("CHIP_EN")->setForceLo();
    csicSetDps ("DVDD_IO", 0 , 300 MA, CONNECT);
    csicSetDps ("VBAT", 0, 300 MA, CONNECT);
    cscUtil->wait(5e-3);
    //csicDisableDpin ("allpins");
    csicSetDpinLevels("io_test_allpins",0, 2.5, 1.0, 1.8);
    csicEnableDpin("io_test_allpins");
    csicSetDpinLevels("XTAL_P",0, 2.5, 1.0, 1.8);
    csicEnableDpin("XTAL_P");
    cscUtil->wait(1e-3);

    csicFuncSeq("warm_up");
    csicSetDps ("DVDD_IO", 2.5 , 300 MA, CONNECT);
    csicSetDps ("VBAT", 2.5, 300 MA, CONNECT);
    cscUtil->wait(2e-3);
	csicFuncTest("Io_test","io_fail","io_test");



//    csicFuncSeq("mbist_test");
//    csicFuncTest("mbist_test","mbist_fail","mbist_test");
    csicFuncTest("mbist_part0_conf","mbist_fail","mbist_part0_conf");
    vector<string> lablist0_mbist;
    lablist0_mbist.clear();
    lablist0_mbist.push_back("mbist_part0_cap.Capdata0_mbist");
    cscTester->DCM()->add("ADC_dcm_mbist_part0",lablist0_mbist,lablist0_mbist,"MBIST_OUT");
    cscTester->DCM()->enable("ADC_dcm_mbist_part0");
    cscUtil->wait(0.001);
    cscExec->Test()->resetCumulativeResult();
    csicFuncSeq("mbist_part0_cap");

    while(cscTester->Seq()->getRunStatus() == BUSY);
    int mbist_part0_capture_count = cscTester->DCM()->getCapturedCycleCount();
    if (mbist_part0_capture_count != 1) {
         cscExec->Datalog()->printf("mbist part0 capture cycle fail\ncycle is %d\n",mbist_part0_capture_count);
    }
CSC_SERIAL_BLOCK_BEGIN
    unsigned long* mbist_part0_capture_data = new unsigned long[mbist_part0_capture_count];
    memset(mbist_part0_capture_data, 0, sizeof(mbist_part0_capture_data));
    cscTester->DCM()->getCapturedDataBySite(*cscIter,"MBIST_OUT",0, mbist_part0_capture_count,mbist_part0_capture_data, DCM_HW);
    mbist_res0[*cscIter] = mbist_part0_capture_data[0];
    /*
    if ((mbist_res0&0x2) == 0) {
       int reset_res = 1;
       csicVariableTest("reset_clk_test_part0","reset_clk_fail",reset_res,0,0,"");
    } else if (mbist_res0 == 0x2) {
       int mbist_res = 0;
       csicVariableTest("mbist_test_part0","mbist_fail",mbist_res,-1,1,"");
    } else {
       int mbist_res = 2;
       csicVariableTest("mbist_test_part0","mbist_fail",mbist_res,-1,1,"");
    }
    */
CSC_SERIAL_BLOCK_END

    csicFuncTest("mbist_part1_conf","mbist_fail","mbist_part1_conf");
    vector<string> lablist1_mbist;
    lablist1_mbist.clear();
    lablist1_mbist.push_back("mbist_part1_cap.Capdata1_mbist");
    cscTester->DCM()->add("ADC_dcm_mbist_part1",lablist1_mbist,lablist1_mbist,"MBIST_OUT");
    cscTester->DCM()->enable("ADC_dcm_mbist_part1");
    cscUtil->wait(0.001);
    cscExec->Test()->resetCumulativeResult();
    csicFuncSeq("mbist_part1_cap");

