minhlg/32_ate/esp32_ft_efuse_test.cpp
/*
    cscExec->Test()->setCurrentName("Dc_Scan_test");
    cscTester->Seq()->setStartAddress("dc_scan");
    cscUtil->wait(0.1e-3);
    cscExec->Test()->func();
    if(cscExec->Test()->getCumulativeResult() == FAIL)
       { DC_scan_result = 1;
       }
    cscExec->Test()->resetCumulativeResult();


    cscExec->Test()->setCurrentName("Ac_Scan_test");
    cscTester->Seq()->setStartAddress("ac_scan");
    cscUtil->wait(0.1e-3);
    cscExec->Test()->func();
    if(cscExec->Test()->getCumulativeResult() == FAIL)
       { AC_scan_result = 1;
       }
    cscExec->Test()->resetCumulativeResult();


*/
    //csicDisableDpin("dc_scan_allpins");
	//cscUtil->wait(0.005);

	//csicSetDps ("alldps", 0, 100 MA, CONNECT);
    //cscUtil->wait(5e-3);
    //csicSetDps ("alldps", 0, 100 MA, DISCONNECT);
    //csicSetDps ("VDD11",  0, 100 MA, DISCONNECT);
    //csicSetDps ("DVDD11", 0, 100 MA, DISCONNECT);
    //cscUtil->wait(1e-3);
    return;

}


//************************************************
//Read ID file, make sure id file is right, get id
//************************************************

struct id_file_info read_chip_id(int machine_site){

struct id_file_info id_file_read={
0,
0,
0,
0,
0,
0,
0,
0,
0};

id_file_read.get_site=machine_site;
//sprintf(id_file_read.filepath,"/usr/local/home/prod/DATA_LOCAL/ESP_ID_file/Chip_ID_ESP32_%d.txt",id_file_read.get_site);
sprintf(id_file_read.filepath,"./Chip_ID_ESP32_%d.txt",id_file_read.get_site);

if(access(id_file_read.filepath, W_OK) != 0) {
    cerr<<"Chip_ID file can not be writen! please reset as writable!\n";
    exit(1);
}

ifstream inIDFile;

inIDFile.open(id_file_read.filepath,ios::in);

if(!inIDFile){

  cerr<<"Chip id file can't be opened!0\n";
  exit(1);
}

    int inID_num = 0;

    while (inIDFile>>hex>>id_file_read.chip_id_array[inID_num]) {
    	inID_num = inID_num + 1;
      if (inID_num > 9) {
        cerr<<"Chip_ID file abnormal!1\n";
        exit(1);
      }
    }

    cout<<"Read info as below:"<<endl;
    int i;
    for(i=0;i<10;i++){
        printf("id_file_read.chip_id_array[%d] is %x\n",i,id_file_read.chip_id_array);
    }




    if (inID_num != 9) {
        cerr<<"Chip_ID file abnormal!2\n";
        exit(1);
    }
    //if ((machine_site>3) | (machine_site<1)) {
    //	printf("Please make sure you are in the engineer mode!\n\r ");
    //}
    if (id_file_read.chip_id_array[0] != machine_site) {
        cerr<<"Chip_ID file is not match with this D10!\n";
        exit(1);
    }

	if ((id_file_read.chip_id_array[8] <= id_file_read.chip_id_array[2]) | (id_file_read.chip_id_array[8] >= id_file_read.chip_id_array[3])) {
	   cerr<<"All Chip_ID has been used!\n";
       exit(1);
	}

	id_file_read.id_delta = id_file_read.chip_id_array[5] - id_file_read.chip_id_array[4];
	printf("delta value: %d \n",id_file_read.id_delta);

	if (id_file_read.id_delta != 2) {
	   cerr<<"Chip_ID file abnormal!3\n";
       exit(1);
	}

    for (inID_num=4;inID_num<8;inID_num++) {
      if ((id_file_read.chip_id_array[inID_num+1] - id_file_read.chip_id_array[inID_num]) != id_file_read.id_delta) {
        cerr<<"Chip_ID file abnormal!4\n";
        exit(1);
      }
    }
    inIDFile.close();


    return id_file_read;

}


//************************************************
//Rewrite id file after efuse burning done
//************************************************
void update_chip_id(struct id_file_info id_file_read,unsigned long long last_id_burned){


ofstream outIDFile;
outIDFile.open(id_file_read.filepath,ios::out);

if(!outIDFile) {
        cerr<<"Chip ID file can't be opened\n";
        exit(1);
    }

int i;
for(i=4;i<9;i++){
    id_file_read.chip_id_array[i]=id_file_read.chip_id_array[i]+id_file_read.id_delta;
}

if(id_file_read.chip_id_array[8]!=last_id_burned){

        cerr<<"Chip ID can't match record!\n";
        exit(1);

}

cout<<"New id as below:"<<endl;

for(i=0;i<9;i++){
    outIDFile<<hex<<id_file_read.chip_id_array[i]<<endl;
    cout<<id_file_read.chip_id_array[i]<<endl;
}
outIDFile.close();

return;
}


void efuse_test_32(){

// for stdf record chip_id_value
    unsigned long long chip_id_value[4] = {0,0,0,0};
    double chip_id_value0[4] = {0,0,0,0};
    double chip_id_value1[4] = {0,0,0,0};
    double efuse_bad[4] = {0,0,0,0};

    struct ate_efuse efuse_read={
    0x1000,
    1,
    {0,0,0,0,0,0},
    0,
    0,
    {0,0,0},
    {0,0},
    {0,0},
    {0,0,0,0,0}
};








    struct ate_efuse efuse_to_burn=efuse_read;
    struct id_file_info id_file_read;

    unsigned long long to_burn_id_l;
    unsigned long long to_burn_id_h;





//initial chip
// read chip efuse,compare(get efuse_read)
// if not burned, burn efuse

CSC_SERIAL_BLOCK_BEGIN
   // 1,read id file,get chip id info
   // 2,make efuse_to_burn
   // 3,burn efuse
   // 4,update id file
   // 5.record burned chip id in stdf


// 1,read id file,get chip id info
id_file_read=read_chip_id(machine_site);

cout<<"read id as below:"<<endl;
int i;
for(i=0;i<10;i++){

    cout<<id_file_read.chip_id_array[i]<<endl;
}


// 2,make efuse_to_burn
to_burn_id_l=id_file_read.chip_id_array[8]+id_file_read.id_delta;
to_burn_id_h=id_file_read.chip_id_array[1];

efuse_to_burn.wifi_mac[0]=to_burn_id_l%256;
efuse_to_burn.wifi_mac[1]=(to_burn_id_l>>8)%256;
efuse_to_burn.wifi_mac[2]=(to_burn_id_l>>16)%256;

efuse_to_burn.wifi_mac[3]=to_burn_id_h%256;
efuse_to_burn.wifi_mac[4]=(to_burn_id_h>>8)%256;
efuse_to_burn.wifi_mac[5]=(to_burn_id_h>>16)%256;

efuse_to_burn.mac_crc=calcrc_bytes(efuse_to_burn.wifi_mac,6);

cout<<"To burn id:"<<to_burn_id_h<<to_burn_id_l<<endl;
printf("To burn efuse: %02x%02x%02x_%02x%02x%02x\n",efuse_to_burn.wifi_mac[5],efuse_to_burn.wifi_mac[4],efuse_to_burn.wifi_mac[3],efuse_to_burn.wifi_mac[2],efuse_to_burn.wifi_mac[1],efuse_to_burn.wifi_mac[0]);


// 3,burn efuse



// 4,update id file

update_chip_id(id_file_read,to_burn_id_l);

// 5.record burned chip id in stdf

  chip_id_value[*cscIter]=to_burn_id_l;
  chip_id_value1[*cscIter] = ((chip_id_value[*cscIter]%0x1000000)/10000000);
  chip_id_value0[*cscIter] = (chip_id_value[*cscIter]%0x1000000)-chip_id_value1[*cscIter]*10000000;

CSC_SERIAL_BLOCK_END


    csicVariableTest("chip_id_part1","efuse_fail",chip_id_value1,0,0x10000000000,"");
    csicVariableTest("chip_id_part0","efuse_fail",chip_id_value0,0,0x10000000000,"");

return;


