minhlg/32_ate/esp32_ft_efuse_test.cpp
}


void efuse_test(int reset_test_res[4],double efuse_burned[4])
{
    unsigned long long chip_id_value[4] = {0,0,0,0};
    double chip_id_value0[4] = {0,0,0,0};
    double chip_id_value1[4] = {0,0,0,0};
    double efuse_bad[4] = {0,0,0,0};


    csicSetDpinLevels("allpins",0.0, 2.5, 1.0, 1.8);
	cscTester->DCLevels()->Signal("RSTB")->setForceLo();
	//cscTester->DCLevels()->Signal("CHIP_EN")->setForceLo();
    csicSetDps ("DVDD_IO", 2.6 , 300 MA, CONNECT);
    csicSetDps ("VBAT",    2.6, 300 MA, CONNECT);
    cscUtil->wait(5e-3);

    //csicDisableDpin ("allpins");
//    csicSetPpmuFV("CHIP_EN",0,20 MA);
//	csicSetPpmuFV("RSTB",2.5 ,20 MA);
//	cscUtil->wait(.005);
    csicSetDpinLevels("efuse_allpins",0.0, 2.5, 1.0, 1.8);
    csicSetDpinLevels("XTAL_P",0.0, 2.5, 1.0, 1.8);
    csicEnableDpin("efuse_allpins");
    csicEnableDpin("XTAL_P");
    cscUtil->wait(1e-3);

    vector<string> lablist0;
    lablist0.clear();
    lablist0.push_back("efuse_read.Capdata0");
    vector<string> lablist1;
    lablist1.clear();
    lablist1.push_back("efuse_read.Capdata1");
    cscTester->DCM()->add("ADC_dcm_efuse",lablist0,lablist1,"EFUSE_OUT");
    cscTester->DCM()->enable("ADC_dcm_efuse");
    csicEnableDpin("efuse_allpins");
    cscUtil->wait(0.001);
    cscExec->Test()->resetCumulativeResult();

    csicFuncSeq("efuse_read");

    while(cscTester->Seq()->getRunStatus() == BUSY);
    int efuse_capture_count = cscTester->DCM()->getCapturedCycleCount();
    if (efuse_capture_count != 257) {
         cscExec->Datalog()->printf("efuse capture cycle fail\ncycle is %d\n",efuse_capture_count);
     }
    csicDisableDpin("efuse_allpins");
	cscTester->DCLevels()->Signal("RSTB")->setForceLo();
	cscTester->DCLevels()->Signal("CHIP_EN")->setForceHi();
    csicDisableDpin("XTAL_P");
	cscUtil->wait(0.001);

	//csicSetDps ("alldps", 0, 100 MA, CONNECT);
    //csicSetDps ("VDD11",  0, 100 MA, CONNECT);
    //csicSetDps ("DVDD11", 0, 100 MA, CONNECT);
    //cscUtil->wait(5e-3);
    //csicSetDps ("alldps", 0, 100 MA, DISCONNECT);
    //csicSetDps ("VDD11",  0, 100 MA, DISCONNECT);
    //csicSetDps ("DVDD11", 0, 100 MA, DISCONNECT);
    //cscUtil->wait(1e-3);

CSC_SERIAL_BLOCK_BEGIN
    ifstream inIDFile;
    if (machine_site ==1) {
      inIDFile.open("/usr/local/home/prod/DATA_LOCAL/ESP_ID_file/Chip_ID_ESP8266_1.txt",ios::in);
    } else if (machine_site == 2) {
    	inIDFile.open("/usr/local/home/prod/DATA_LOCAL/ESP_ID_file/Chip_ID_ESP8266_2.txt",ios::in);
	} else if (machine_site == 3) {
    	inIDFile.open("/usr/local/home/prod/DATA_LOCAL/ESP_ID_file/Chip_ID_ESP8266_3.txt",ios::in);
	} else if (machine_site == 4) {
    	inIDFile.open("/usr/local/home/prod/DATA_LOCAL/ESP_ID_file/Chip_ID_ESP8266_4.txt",ios::in);
	} else if (machine_site == 5) {
    	inIDFile.open("/usr/local/home/prod/DATA_LOCAL/ESP_ID_file/Chip_ID_ESP8266_5.txt",ios::in);
	} else if (machine_site == 6) {
    	inIDFile.open("/usr/local/home/prod/DATA_LOCAL/ESP_ID_file/Chip_ID_ESP8266_6.txt",ios::in);
	}


    if(!inIDFile) {
        cerr<<"Chip ID file can't be opened\n";
        exit(1);
    }
    int inID_num = 0;
    unsigned long long chip_id_array[10] = {0,0,0,0,0,0,0,0,0};

    while (inIDFile>>hex>>chip_id_array[inID_num]) {
    	inID_num = inID_num + 1;
  if (inID_num > 9) {
        cerr<<"Chip_ID file abnormal!1\n";
        exit(1);
      }
    }
    if (inID_num != 9) {
        cerr<<"Chip_ID file abnormal!2\n";
        exit(1);
    }
    if ((machine_site>6) | (machine_site<1)) {
    	printf("Please make sure you are in the engineer mode!\n\r ");
    }
    else if (chip_id_array[0] != machine_site) {
        cerr<<"Chip_ID file is not match with this D10!\n";
        exit(1);
    }

	if ((chip_id_array[8] <= chip_id_array[2]) | (chip_id_array[8] >= chip_id_array[3])) {
	   cerr<<"All Chip_ID has been used!\n";
       exit(1);
	}

	int delta = chip_id_array[5] - chip_id_array[4];
	//printf("delta value: %d \n",delta);

	if ((delta != 1) & (delta != -1)) {
	   cerr<<"Chip_ID file abnormal!3\n";
       exit(1);
	}

    for (inID_num=4;inID_num<8;inID_num++) {
      if ((chip_id_array[inID_num+1] - chip_id_array[inID_num]) != delta) {
        cerr<<"Chip_ID file abnormal!4\n";
        exit(1);
      }
    }
    inIDFile.close();


    unsigned long* efuse_data_opp = new unsigned long[257];
    unsigned long* efuse_data     = new unsigned long[128];
    memset(efuse_data_opp, 1, sizeof(efuse_data_opp));
    memset(efuse_data,     1, sizeof(efuse_data));
    cscTester->DCM()->getCapturedDataBySite(*cscIter,"EFUSE_OUT",0, efuse_capture_count,efuse_data_opp, DCM_HW);
    int i =0;
    for (i=0;i<256;i++) {
      if ((i%2) == 0) {
        efuse_data[127-i/2] = efuse_data_opp[i];
//        cscExec->Datalog()->printf("num %d:%x\n",127-i/2,efuse_data[127-i/2]);
      }
    }

    unsigned long long mac_addr_read=0;
    unsigned char mac_addr_read_byte_l[4] = {0,0,0,0};
    unsigned char mac_addr_read_byte_h[3] = {0,0,0};
    unsigned char mac_crc_read_l =0;
    unsigned char mac_crc_read_h =0;
    unsigned char mac_crc_exp_l =0;
    unsigned char mac_crc_exp_h =0;

    unsigned long efuse_version_read = (efuse_data[59] <<3) + (efuse_data[58] <<2) + (efuse_data[57] <<1) + (efuse_data[56] <<0);
//    cscExec->Datalog()->printf("efuse version %d\n",efuse_version_read);
    if (efuse_version_read == 0) {
    	for (i=0;i<128;i++) {
    	  if (efuse_data[i]!=0) {
    	    efuse_bad[*cscIter] = 12;
    	  }
    	}
//        cscExec->Datalog()->printf("In case 1\n");

    } else if (efuse_version_read != 2) {
    	efuse_bad[*cscIter] = 3;
//        cscExec->Datalog()->printf("In case 1\n");
    } else {
//      cscExec->Datalog()->printf("In case 2\n");
      for (i=124;i<128;i++) {
        if (efuse_data[i] != 0) {
          efuse_bad[*cscIter] = 4;
        }
      }
      for (i=120;i<124;i++) {
        if (efuse_data[i] != 0) {
          efuse_bad[*cscIter] = 3;
        }
      }
      for (i=80;i<88;i++) {
        if (efuse_data[i] != 0) {
          efuse_bad[*cscIter] = 9;
        }
      }

