minhlg/32_ate/esp32_ft_efuse_test.cpp
      if (efuse_data[79] != 1) {
        efuse_bad[*cscIter] = 5;
      }
      if (efuse_data[78] != 0) {
        efuse_bad[*cscIter] = 6;
      }
      if (efuse_data[77] != 1) {
        efuse_bad[*cscIter] = 7;
      }
      for (i=60;i<76;i++) {
        if (efuse_data[i] != 0) {
          efuse_bad[*cscIter] = 8;
        }
      }
      for (i=0;i<16;i++) {
        if (efuse_data[i] != 0) {
          efuse_bad[*cscIter] = 2;
        }
      }
      for (i=24;i<56;i++) {
      	mac_addr_read = mac_addr_read + (efuse_data[i] << (i-24));
        mac_addr_read_byte_l[(i-24)/8] = mac_addr_read_byte_l[(i-24)/8] + (efuse_data[i] << ((i-24)%8));
      }
      for (i=16;i<24;i++) {
        mac_crc_read_l = mac_crc_read_l + (efuse_data[i] << (i-16));
      }
      mac_crc_exp_l = calcrc_bytes(mac_addr_read_byte_l,4);
//      cscExec->Datalog()->printf("efuse crc read : 0x%x,crc exp 0x%x\n",mac_crc_read,mac_crc_exp);
      if (mac_crc_exp_l != mac_crc_read_l) {
        efuse_bad[*cscIter] = 1;
      } else {
        efuse_burned[*cscIter] = 1;
      }

      if (efuse_data[76] == 1) {
        for (i=96;i<120;i++) {
          mac_addr_read_byte_h[(i-96)/8] = mac_addr_read_byte_h[(i-96)/8] + (efuse_data[i] << ((i-96)%8));
        }
        for (i=88;i<96;i++) {
          mac_crc_read_h = mac_crc_read_h + (efuse_data[i] << (i-88));
        }
        mac_crc_exp_h = calcrc_bytes(mac_addr_read_byte_h,3);
//          cscExec->Datalog()->printf("efuse crc read : 0x%x,crc exp 0x%x\n",mac_crc_read,mac_crc_exp);
        if (mac_crc_exp_h != mac_crc_read_h) {
          efuse_bad[*cscIter] = 11;
        } else {
          efuse_burned[*cscIter] = 1;
        }
      } else {
      	for (i=88;i<120;i++) {
          if (efuse_data[i] != 0) {
            efuse_bad[*cscIter] = 10;
          }
        }
      }
    }

    if (efuse_bad[*cscIter]) {
       //csicVariableTest("efuse_is_ok","efuse_fail",efuse_bad,0,0,"");
       //csicVariableTest("chip_id","efuse_fail",mac_addr_read,0,0x100000000,"");
       //csicVariableTest("efuse_burned","efuse_fail",efuse_burned,1,1,"");
       chip_id_value[*cscIter] =0;
       for (i=16;i<56;i++) {
         chip_id_value[*cscIter] = chip_id_value[*cscIter] + (efuse_data[i] << (i-16));
       }
    } else if (efuse_burned[*cscIter]) {
       //csicVariableTest("efuse_is_ok","efuse_fail",efuse_bad,0,0,"");
       //csicVariableTest("chip_id","efuse_fail",mac_addr_read,0,0x100000000,"");
       //csicVariableTest("efuse_burned","efuse_fail",efuse_burned,1,1,"");
       chip_id_value[*cscIter] = mac_addr_read;
       if ((chip_id_value[*cscIter] >= chip_id_array[3]) | (chip_id_value[*cscIter]<= chip_id_array[2])) {
         efuse_bad[*cscIter] = 12;
       }
    } else if (reset_test_res[*cscIter] == 0) {//0:mbist not pass
       chip_id_value[*cscIter] = mac_addr_read;
    } else {
    unsigned long long chip_id = 0,bit_id = 0,bit_addr_in = 0,bit_addr_out = 0;
    chip_id = chip_id_array[8];
//    cout<<"CHIP_ID is "<<chip_id+1<<endl;

    std::vector<std::string> sigGroupNames;
    std::vector<char> vec;

    int singbit = 0;
    bit_addr_in = cscTester->PatternMemory()->getLabelAddress("efuse.in_bit0");
    bit_addr_out = cscTester->PatternMemory()->getLabelAddress("efuse.out_bit80");



    chip_id = chip_id + delta;

    //printf("chip_id: %x \n",chip_id);

    chip_id_value[*cscIter]  = chip_id;
    unsigned char mac_addr_l[4];
    unsigned char mac_addr_h[3];
    unsigned char mac_addr_crc_h;
    unsigned char mac_addr_crc_l;

    mac_addr_l[0] = chip_id%256;
    mac_addr_l[1] = (chip_id>>8)%256;
    mac_addr_l[2] = (chip_id>>16)%256;
    mac_addr_l[3] = 0;
    mac_addr_h[0] = chip_id_array[1]%256;
    mac_addr_h[1] = (chip_id_array[1]>>8)%256;
    mac_addr_h[2] = (chip_id_array[1]>>16)%256;
    mac_addr_crc_l = calcrc_bytes(mac_addr_l,4);
    mac_addr_crc_h = calcrc_bytes(mac_addr_h,3);
    unsigned char efuse_version = 2;
    unsigned char efuse_data[6];
    //mac_addr_crc = 0x1;

    unsigned long* efuse_to_burn_data = new unsigned long[16];

    efuse_to_burn_data[0] = 0;
    efuse_to_burn_data[1] = 0;
    efuse_to_burn_data[2] = mac_addr_crc_l;
    efuse_to_burn_data[3] = mac_addr_l[0];
    efuse_to_burn_data[4] = mac_addr_l[1];
    efuse_to_burn_data[5] = mac_addr_l[2];
    efuse_to_burn_data[6] = mac_addr_l[3];
    efuse_to_burn_data[7] = efuse_version;
    efuse_to_burn_data[8] = 0;
    efuse_to_burn_data[9] = 0xb0;
    efuse_to_burn_data[10] = 0;
    efuse_to_burn_data[11] = mac_addr_crc_h;
    efuse_to_burn_data[12] = mac_addr_h[0];
    efuse_to_burn_data[13] = mac_addr_h[1];
    efuse_to_burn_data[14] = mac_addr_h[2];
    efuse_to_burn_data[15] = 0;


//cscExec->Datalog()->printf("\nBit num is:\n");
    for(int i=0;i<128;i++) {
        if (i%8 ==0) {
          bit_id = efuse_to_burn_data[i/8];
        }
        singbit = bit_id%2;
        bit_id = bit_id/2;
//        cscExec->Datalog()->printf("num %d:%x\n",i,singbit);
//        cout<<singbit<<endl;

        if(singbit == 1) {
            sigGroupNames.clear();sigGroupNames.push_back("SD_D1");
            vec.clear();vec.push_back('1');
            cscTester->PatternMemory()->setVectorDataAtAddress(bit_addr_in,sigGroupNames,vec);
            bit_addr_in++;
            cscTester->PatternMemory()->setVectorDataAtAddress(bit_addr_in,sigGroupNames,vec);
            bit_addr_in++;

            /*
            sigGroupNames.clear();sigGroupNames.push_back("MTDO");
            vec.clear();vec.push_back('H');
            cscTester->PatternMemory()->setVectorDataAtAddress(bit_addr_out,sigGroupNames,vec);
            bit_addr_out = bit_addr_out -2;
            */
//  cscExec->Datalog()->printf("%d ",singbit);

        }
        else
        {
            sigGroupNames.clear();sigGroupNames.push_back("SD_D1");
            vec.clear();vec.push_back('0');
            cscTester->PatternMemory()->setVectorDataAtAddress(bit_addr_in,sigGroupNames,vec);
            bit_addr_in++;
            cscTester->PatternMemory()->setVectorDataAtAddress(bit_addr_in,sigGroupNames,vec);
            bit_addr_in++;

