minhlg/32_ate/esp32_ft_efuse_test.cpp
            /*
            sigGroupNames.clear();sigGroupNames.push_back("MTDO");
            vec.clear();vec.push_back('L');
            cscTester->PatternMemory()->setVectorDataAtAddress(bit_addr_out,sigGroupNames,vec);
            bit_addr_out = bit_addr_out -2;
            */
//  cscExec->Datalog()->printf("%d ",singbit);
        }

    }
    ofstream outIDFile;
    if (machine_site == 1) {
      outIDFile.open("/usr/local/home/prod/DATA_LOCAL/ESP_ID_file/Chip_ID_ESP8266_1.txt",ios::out);
    }	else if (machine_site == 2) {
    	outIDFile.open("/usr/local/home/prod/DATA_LOCAL/ESP_ID_file/Chip_ID_ESP8266_2.txt",ios::out);
    }   else if (machine_site == 3) {
    	outIDFile.open("/usr/local/home/prod/DATA_LOCAL/ESP_ID_file/Chip_ID_ESP8266_3.txt",ios::out);
    } else if (machine_site == 4) {
    	outIDFile.open("/usr/local/home/prod/DATA_LOCAL/ESP_ID_file/Chip_ID_ESP8266_4.txt",ios::out);
    } else if (machine_site == 5) {
    	outIDFile.open("/usr/local/home/prod/DATA_LOCAL/ESP_ID_file/Chip_ID_ESP8266_5.txt",ios::out);
    } else if (machine_site == 6) {
    	outIDFile.open("/usr/local/home/prod/DATA_LOCAL/ESP_ID_file/Chip_ID_ESP8266_6.txt",ios::out);
    }

    if(!outIDFile) {
        cerr<<"Chip ID file can't be opened\n";
        exit(1);
    }
    outIDFile<<hex<<chip_id_array[0]<<endl;
    outIDFile<<hex<<chip_id_array[1]<<endl;
    outIDFile<<hex<<chip_id_array[2]<<endl;
    outIDFile<<hex<<chip_id_array[3]<<endl;
    outIDFile<<hex<<chip_id_array[5]<<endl;
    outIDFile<<hex<<chip_id_array[6]<<endl;
    outIDFile<<hex<<chip_id_array[7]<<endl;
    outIDFile<<hex<<chip_id_array[8]<<endl;
    outIDFile<<hex<<chip_id<<endl;
    outIDFile.close();

    csicSetDpinLevels("allpins",0.0, 2.5, 1.0, 1.8);
	cscTester->DCLevels()->Signal("RSTB")->setForceLo();
	//cscTester->DCLevels()->Signal("CHIP_EN")->setForceLo();
    csicSetDps ("DVDD_IO", 2.6 , 300 MA, CONNECT);
    csicSetDps ("VBAT",    2.6, 300 MA, CONNECT);
    cscUtil->wait(5e-3);

    //csicDisableDpin ("allpins");
//    csicSetPpmuFV("CHIP_EN",0,20 MA);
//	csicSetPpmuFV("RSTB",2.5 ,20 MA);
//	cscUtil->wait(.005);
    csicSetDpinLevels("efuse_allpins",0.0, 2.5, 1.0, 1.8);
    csicSetDpinLevels("XTAL_P",0.0, 2.5, 1.0, 1.8);
    csicEnableDpin("efuse_allpins");
    csicEnableDpin("XTAL_P");
    cscUtil->wait(1e-3);
    //csicFuncTest("Efuse_test","efuse_fail","efuse");
    csicFuncSeq("efuse");
//    csicVariableTest("Pause","func_idd_fail",1 ,1 ,1 ,"V");

    //csicVariableTest("chip_id","efuse_fail",chip_id,0,0x100000000,"");
    //csicVariableTest("efuse_is_ok","efuse_fail",efuse_bad,0,0,"");
    //csicVariableTest("chip_id","efuse_fail",chip_id,0,0x100000000,"");
    //csicVariableTest("efuse_burned","efuse_fail",efuse_burned,1,1,"");

    cscUtil->wait(0.001);
  }

    //csicVariableTest("efuse_is_ok","efuse_fail",efuse_bad,0,0,"");
    //csicVariableTest("chip_id","efuse_fail",chip_id,0,0x100000000,"");


    csicDisableDpin("efuse_allpins");
	cscTester->DCLevels()->Signal("RSTB")->setForceLo();
	cscTester->DCLevels()->Signal("CHIP_EN")->setForceHi();
    csicDisableDpin("XTAL_P");

  chip_id_value1[*cscIter] = ((chip_id_value[*cscIter]%0x1000000)/10000000);
  chip_id_value0[*cscIter] = (chip_id_value[*cscIter]%0x1000000)-chip_id_value1[*cscIter]*10000000;


CSC_SERIAL_BLOCK_END

    csicVariableTest("chip_id_part1","efuse_fail",chip_id_value1,0,0x10000000000,"");
    csicVariableTest("chip_id_part0","efuse_fail",chip_id_value0,0,0x10000000000,"");
    csicVariableTest("efuse_is_ok","efuse_fail",efuse_bad,0,0,"");
    csicVariableTest("efuse_burned","efuse_fail",efuse_burned,0,1,"");

	//csicSetDps ("alldps", 0, 100 MA, CONNECT);
    //csicSetDps ("VDD11",  0, 100 MA, CONNECT);
    //csicSetDps ("DVDD11", 0, 100 MA, CONNECT);
    //cscUtil->wait(5e-3);
    //csicSetDps ("alldps", 0, 100 MA, DISCONNECT);
    //csicSetDps ("VDD11",  0, 100 MA, DISCONNECT);
    //csicSetDps ("DVDD11", 0, 100 MA, DISCONNECT);
    //cscUtil->wait(1e-3);
    return ;
}



/**********************************************************************************************************
Function Name:  user_load ()
Description:    Use to precondition the device before testing, such as control Relay power and DClevel STIL
                file.
Test Required:
Test Comment:
**********************************************************************************************************/
int user_load ()
{
  cout << "#### Test parameters setting before START testing......" << endl;

  //InitUserFlag
  cscExec->UserFlag()->setInt("csicDebug", 0);    /* Enable csicDebug*/
  cscExec->UserFlag()->setInt("csicPpmuAcc", 0);  /*Enable PPMU accuracy measurement*/
  //cscExec->Datalog()->printf("Enable test time show on datalog.\n");
  cscExec->UserFlag()->setInt("csicTimer", 0);    /* "1", Enable test time show on datalog*/
  cscExec->UserFlag()->setInt("csicStdfFlag", 0); /* "1", Enable log StdfFlag*/
  cscExec->UserFlag()->setInt("SAVE_AWAV", 0);    /* Enable csicDebug*/
  cscExec->UserFlag()->setInt("RTlogFlag", 0);    /* Enable csicDebug*/

//  cscExec->Cmd()->execute("Log Source DCM");
//  cscExec->Cmd()->execute("Log Count 10");

  //csicLoadSpecFile("myproj.spec");
  csicDibuPowerOn("P5V_RLY"); /*suggest to put this line in user_load() rather than putting in user_main()*/
  csicDibuPowerOn("P5V");
  csicFixtureRelayOff("K1");
  csicFixtureRelayOff("K2");
  return(0);
}

/**********************************************************************************************************
Function Name:  user_sot ()
Description:    Use to debug, variable setting and it be exectue when first test after loaded test program.
Test Required:
Test Comment:
**********************************************************************************************************/
int user_sot ()
{
//        csicStdfSet(1);//sampling

  csicLogTimeStart();
  static int FirstTime = 1;
  if  (FirstTime == 1)
      { cscExec->UserFlag()->setInt("FirstTime", 1);
        FirstTime = 0;}


  if  (cscExec->UserFlag()->getInt("FirstTime") == 1)
      { cout<< "#### Doing first run UserFlag setup ......" << endl;
        cscExec->Cmd()->execute("Log Source DCM");
        cscExec->Cmd()->execute("Log Count 10");
        // Do some first run need to setup
        cscExec->UserFlag()->setInt("FirstTime", 0);}

  return(0);
}

/*================= Main test program User_main () ========================================================
Function Name:  user_main ()
Description:    All test item be execute in here, you can control test item testing sequence, mask test
                item and callback subroutine etc.
Test Required:
Test Comment:
=================== End of Main test program User_main () ===============================================*/
int user_main(void)
{

